In [1]:
import argparse
import glob
import os
import json
import time
import logging
import random
import re
from itertools import chain
from string import punctuation

import sys

ROOT = os.path.join(os.path.dirname(os.getcwd()), 'backend')
if ROOT not in sys.path:
    sys.path.append(ROOT)

import pandas as pd
import numpy as np


seed_number = 42
from app.dataService import globalVariable as GV
from app.dataService.utils.processSQL import process_sql, decode_sql, generate_sql
db_schema, db_names, tables = process_sql.get_schemas_from_json(
            os.path.join(GV.SPIDER_FOLDER, "tables.json"))

/home/xingbo/anaconda3/envs/chi2022/lib/python3.7/site-packages/sklearn/feature_extraction/image.py:167: DeprecationWarning: `np.int` is a deprecated alias for the builtin `int`. To silence this warning, use `int` by itself. Doing this will not modify any behavior and is safe. When replacing `np.int`, you may wish to use e.g. `np.int64` or `np.int32` to specify the precision. If you wish to review your current use, check the release note link for additional information.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  dtype=np.int):
/home/xingbo/anaconda3/envs/chi2022/lib/python3.7/site-packages/sklearn/linear_model/least_angle.py:30: DeprecationWarning: `np.float` is a deprecated alias for the builtin `float`. To silence this warning, use `float` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.float64` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  method='lar', copy_X=True, eps=np.finfo(np.float).eps,
/home/xingbo/anaconda3/envs/chi2022/lib/python3.7/site-packages/sklearn/linear_model/least_angle.py:167: DeprecationWarning: `np.float` is a deprecated alias for the builtin `float`. To silence this warning, use `float` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.float64` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  method='lar', copy_X=True, eps=np.finfo(np.float).eps,
/home/xingbo/anaconda3/envs/chi2022/lib/python3.7/site-packages/sklearn/linear_model/least_angle.py:284: DeprecationWarning: `np.float` is a deprecated alias for the builtin `float`. To silence this warning, use `float` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.float64` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  eps=np.finfo(np.float).eps, copy_Gram=True, verbose=0,
/home/xingbo/anaconda3/envs/chi2022/lib/python3.7/site-packages/sklearn/linear_model/least_angle.py:862: DeprecationWarning: `np.float` is a deprecated alias for the builtin `float`. To silence this warning, use `float` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.float64` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  eps=np.finfo(np.float).eps, copy_X=True, fit_path=True,
/home/xingbo/anaconda3/envs/chi2022/lib/python3.7/site-packages/sklearn/linear_model/least_angle.py:1101: DeprecationWarning: `np.float` is a deprecated alias for the builtin `float`. To silence this warning, use `float` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.float64` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  eps=np.finfo(np.float).eps, copy_X=True, fit_path=True,
/home/xingbo/anaconda3/envs/chi2022/lib/python3.7/site-packages/sklearn/linear_model/least_angle.py:1127: DeprecationWarning: `np.float` is a deprecated alias for the builtin `float`. To silence this warning, use `float` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.float64` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  eps=np.finfo(np.float).eps, positive=False):
/home/xingbo/anaconda3/envs/chi2022/lib/python3.7/site-packages/sklearn/linear_model/least_angle.py:1362: DeprecationWarning: `np.float` is a deprecated alias for the builtin `float`. To silence this warning, use `float` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.float64` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  max_n_alphas=1000, n_jobs=None, eps=np.finfo(np.float).eps,
/home/xingbo/anaconda3/envs/chi2022/lib/python3.7/site-packages/sklearn/linear_model/least_angle.py:1602: DeprecationWarning: `np.float` is a deprecated alias for the builtin `float`. To silence this warning, use `float` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.float64` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  max_n_alphas=1000, n_jobs=None, eps=np.finfo(np.float).eps,
/home/xingbo/anaconda3/envs/chi2022/lib/python3.7/site-packages/sklearn/linear_model/least_angle.py:1738: DeprecationWarning: `np.float` is a deprecated alias for the builtin `float`. To silence this warning, use `float` by itself. Doing this will not modify any behavior and is safe. If you specifically wanted the numpy scalar type, use `np.float64` here.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  eps=np.finfo(np.float).eps, copy_X=True, positive=False):

In [2]:
# table meta data
with open( os.path.join(GV.SPIDER_FOLDER, "tables.json"), "r") as f:
    table_data = json.load(f)
t_df = pd.DataFrame(table_data)
t_df

,column_names,column_names_original,column_types,db_id,foreign_keys,primary_keys,table_names,table_names_original
0,"[[-1, *], [0, perpetrator id], [0, people id],...","[[-1, *], [0, Perpetrator_ID], [0, People_ID],...","[text, number, number, text, number, text, tex...",perpetrator,"[[2, 9]]","[1, 9]","[perpetrator, people]","[perpetrator, people]"
1,"[[-1, *], [0, building], [0, room number], [0,...","[[-1, *], [0, building], [0, room_number], [0,...","[text, text, text, number, text, text, number,...",college_2,"[[9, 4], [13, 4], [19, 1], [20, 2], [15, 7], [...","[1, 4, 7, 11, 15, 22, 27, 31, 37, 39, 45]","[classroom, department, course, instructor, se...","[classroom, department, course, instructor, se..."
2,"[[-1, *], [0, id], [0, city], [0, country], [0...","[[-1, *], [0, id], [0, City], [0, Country], [0...","[text, number, text, text, text, text, text, n...",flight_company,"[[20, 7], [19, 1]]","[1, 7, 13]","[airport, operate company, flight]","[airport, operate_company, flight]"
3,"[[-1, *], [0, institution id], [0, name], [0, ...","[[-1, *], [0, instID], [0, name], [0, country]...","[text, number, text, text, number, text, text,...",icfp_1,"[[11, 7], [10, 1], [9, 4]]","[1, 4, 7, 9]","[institution, authors, papers, authorship count]","[Inst, Authors, Papers, Authorship]"
4,"[[-1, *], [0, body builder id], [0, people id]...","[[-1, *], [0, Body_Builder_ID], [0, People_ID]...","[text, number, number, number, number, number,...",body_builder,"[[2, 6]]","[1, 6]","[body builder, people]","[body_builder, people]"
...,...,...,...,...,...,...,...,...
161,"[[-1, *], [0, employee ssn], [0, project numbe...","[[-1, *], [0, Essn], [0, Pno], [0, Hours], [1,...","[text, number, number, number, text, text, tex...",company_1,[],"[1, 7, 15, 19, 22, 27]","[works on, employee, department, project, depe...","[works_on, employee, department, project, depe..."
162,"[[-1, *], [0, workshop id], [0, date], [0, ven...","[[-1, *], [0, Workshop_ID], [0, Date], [0, Ven...","[text, number, text, text, text, number, numbe...",workshop_paper,"[[10, 1], [9, 5]]","[1, 5, 9]","[workshop, submission, acceptance]","[workshop, submission, Acceptance]"
163,"[[-1, *], [0, item id], [0, title], [1, a id],...","[[-1, *], [0, i_id], [0, title], [1, a_id], [1...","[text, number, text, number, number, number, n...",epinions_1,"[[5, 1], [4, 8], [11, 8], [10, 8]]","[1, 3, 8]","[item, review, useracct, trust]","[item, review, useracct, trust]"
164,"[[-1, *], [0, party id], [0, party theme], [0,...","[[-1, *], [0, Party_ID], [0, Party_Theme], [0,...","[text, number, text, text, text, text, number,...",party_host,"[[11, 1], [12, 7]]","[1, 7, 11]","[party, host, party host]","[party, host, party_host]"
165,"[[-1, *], [0, attribute id], [0, attribute nam...","[[-1, *], [0, attribute_id], [0, attribute_nam...","[text, number, text, text, number, text, text,...",product_catalog,"[[10, 4], [13, 9], [27, 9], [26, 12]]","[1, 4, 9, 12]","[attribute definitions, catalogs, catalog stru...","[Attribute_Definitions, Catalogs, Catalog_Stru..."

In [3]:
t_df.iloc[0]

column_names             [[-1, *], [0, perpetrator id], [0, people id],...
column_names_original    [[-1, *], [0, Perpetrator_ID], [0, People_ID],...
column_types             [text, number, number, text, number, text, tex...
db_id                                                          perpetrator
foreign_keys                                                      [[2, 9]]
primary_keys                                                        [1, 9]
table_names                                          [perpetrator, people]
table_names_original                                 [perpetrator, people]
Name: 0, dtype: object

In [4]:
# table query data (just for training)
with open( os.path.join(GV.SPIDER_FOLDER, "train_spider.json"), "r") as f:
    query_data = json.load(f)
q_df = pd.DataFrame(query_data)
q_df

,db_id,query,query_toks,query_toks_no_value,question,question_toks,sql
0,department_management,SELECT count(*) FROM head WHERE age > 56,"[SELECT, count, (, *, ), FROM, head, WHERE, ag...","[select, count, (, *, ), from, head, where, ag...",How many heads of the departments are older th...,"[How, many, heads, of, the, departments, are, ...","{'from': {'table_units': [['table_unit', 1]], ..."
1,department_management,"SELECT name , born_state , age FROM head ORD...","[SELECT, name, ,, born_state, ,, age, FROM, he...","[select, name, ,, born_state, ,, age, from, he...","List the name, born state and age of the heads...","[List, the, name, ,, born, state, and, age, of...","{'from': {'table_units': [['table_unit', 1]], ..."
2,department_management,"SELECT creation , name , budget_in_billions ...","[SELECT, creation, ,, name, ,, budget_in_billi...","[select, creation, ,, name, ,, budget_in_billi...","List the creation year, name and budget of eac...","[List, the, creation, year, ,, name, and, budg...","{'from': {'table_units': [['table_unit', 0]], ..."
3,department_management,"SELECT max(budget_in_billions) , min(budget_i...","[SELECT, max, (, budget_in_billions, ), ,, min...","[select, max, (, budget_in_billions, ), ,, min...",What are the maximum and minimum budget of the...,"[What, are, the, maximum, and, minimum, budget...","{'from': {'table_units': [['table_unit', 0]], ..."
4,department_management,SELECT avg(num_employees) FROM department WHER...,"[SELECT, avg, (, num_employees, ), FROM, depar...","[select, avg, (, num_employees, ), from, depar...",What is the average number of employees of the...,"[What, is, the, average, number, of, employees...","{'from': {'table_units': [['table_unit', 0]], ..."
...,...,...,...,...,...,...,...
6995,culture_company,SELECT T1.company_name FROM culture_company AS...,"[SELECT, T1.company_name, FROM, culture_compan...","[select, t1, ., company_name, from, culture_co...",What are all the company names that have a boo...,"[What, are, all, the, company, names, that, ha...","{'from': {'table_units': [['table_unit', 2], [..."
6996,culture_company,"SELECT T1.title , T3.book_title FROM movie AS...","[SELECT, T1.title, ,, T3.book_title, FROM, mov...","[select, t1, ., title, ,, t3, ., book_title, f...",Show the movie titles and book titles for all ...,"[Show, the, movie, titles, and, book, titles, ...","{'from': {'table_units': [['table_unit', 1], [..."
6997,culture_company,"SELECT T1.title , T3.book_title FROM movie AS...","[SELECT, T1.title, ,, T3.book_title, FROM, mov...","[select, t1, ., title, ,, t3, ., book_title, f...",What are the titles of movies and books corres...,"[What, are, the, titles, of, movies, and, book...","{'from': {'table_units': [['table_unit', 1], [..."
6998,culture_company,SELECT T2.company_name FROM movie AS T1 JOIN c...,"[SELECT, T2.company_name, FROM, movie, AS, T1,...","[select, t2, ., company_name, from, movie, as,...",Show all company names with a movie directed i...,"[Show, all, company, names, with, a, movie, di...","{'from': {'table_units': [['table_unit', 1], [..."
6999,culture_company,SELECT T2.company_name FROM movie AS T1 JOIN c...,"[SELECT, T2.company_name, FROM, movie, AS, T1,...","[select, t2, ., company_name, from, movie, as,...",What are all company names that have a corresp...,"[What, are, all, company, names, that, have, a...","{'from': {'table_units': [['table_unit', 1], [..."

In [14]:
q_df[q_df["db_id"] == "customers_and_addresses"].loc[6059].values

array(['customers_and_addresses',
       'SELECT avg(order_quantity) FROM order_items',
       list(['SELECT', 'avg', '(', 'order_quantity', ')', 'FROM', 'order_items']),
       list(['select', 'avg', '(', 'order_quantity', ')', 'from', 'order_items']),
       'What is the average amount of items ordered in each order?',
       list(['What', 'is', 'the', 'average', 'amount', 'of', 'items', 'ordered', 'in', 'each', 'order', '?']),
       {'from': {'table_units': [['table_unit', 6]], 'conds': []}, 'select': [False, [[5, [0, [0, 32, False], None]]]], 'where': [], 'groupBy': [], 'having': [], 'orderBy': [], 'limit': None, 'intersect': None, 'union': None, 'except': None}],
      dtype=object)

In [23]:
q_df["sql"][:10].values[0]

{'from': {'table_units': [['table_unit', 1]], 'conds': []},
 'select': [False, [[3, [0, [0, 0, False], None]]]],
 'where': [[False, 3, [0, [0, 10, False], None], 56.0, None]],
 'groupBy': [],
 'having': [],
 'orderBy': [],
 'limit': None,
 'intersect': None,
 'union': None,
 'except': None}

In [24]:
grouped = q_df.groupby("db_id")
g_info = [[name, len(group)] for name, group in grouped]

In [25]:
sorted(g_info, key=lambda a:a[1], reverse=True)

[['college_2', 170],
 ['college_1', 164],
 ['hr_1', 124],
 ['store_1', 112],
 ['soccer_2', 106],
 ['bike_1', 104],
 ['dorm_1', 100],
 ['hospital_1', 100],
 ['music_1', 100],
 ['music_2', 100],
 ['allergy_1', 98],
 ['movie_1', 98],
 ['flight_1', 96],
 ['driving_school', 93],
 ['cre_Doc_Tracking_DB', 90],
 ['activity_1', 88],
 ['customers_and_addresses', 88],
 ['department_store', 88],
 ['game_1', 86],
 ['network_2', 86],
 ['products_gen_characteristics', 86],
 ['chinook_1', 84],
 ['cre_Docs_and_Epenses', 84],
 ['cre_Theme_park', 84],
 ['baseball_1', 82],
 ['cre_Drama_Workshop_Groups', 82],
 ['customers_and_invoices', 82],
 ['e_learning', 82],
 ['flight_4', 82],
 ['sakila_1', 82],
 ['wine_1', 82],
 ['apartment_rentals', 80],
 ['customers_card_transactions', 80],
 ['formula_1', 80],
 ['loan_1', 80],
 ['manufactory_1', 80],
 ['tracking_grants_for_research', 78],
 ['college_3', 74],
 ['inn_1', 74],
 ['voter_2', 72],
 ['club_1', 70],
 ['csu_1', 70],
 ['election', 68],
 ['student_1', 68],
 ['icfp_1', 66],
 ['music_4', 60],
 ['tracking_orders', 60],
 ['match_season', 58],
 ['student_assessment', 53],
 ['sports_competition', 52],
 ['small_bank_1', 50],
 ['film_rank', 48],
 ['insurance_policies', 48],
 ['scientist_1', 48],
 ['ship_1', 48],
 ['tracking_software_problems', 48],
 ['aircraft', 46],
 ['customer_complaints', 46],
 ['gas_company', 46],
 ['university_basketball', 46],
 ['document_management', 44],
 ['medicine_enzyme_interaction', 44],
 ['party_people', 44],
 ['shop_membership', 44],
 ['store_product', 44],
 ['storm_record', 44],
 ['insurance_fnol', 42],
 ['product_catalog', 42],
 ['race_track', 42],
 ['tracking_share_transactions', 41],
 ['behavior_monitoring', 40],
 ['candidate_poll', 40],
 ['city_record', 40],
 ['climbing', 40],
 ['company_office', 40],
 ['county_public_safety', 40],
 ['device', 40],
 ['e_government', 40],
 ['entrepreneur', 40],
 ['farm', 40],
 ['gymnast', 40],
 ['insurance_and_eClaims', 40],
 ['musical', 40],
 ['program_share', 40],
 ['school_player', 40],
 ['theme_gallery', 40],
 ['wrestler', 40],
 ['culture_company', 38],
 ['cre_Doc_Control_Systems', 33],
 ['assets_maintenance', 31],
 ['cinema', 30],
 ['epinions_1', 30],
 ['machine_repair', 30],
 ['party_host', 30],
 ['ship_mission', 30],
 ['swimming', 30],
 ['workshop_paper', 30],
 ['phone_1', 29],
 ['twitter_1', 27],
 ['school_finance', 26],
 ['body_builder', 24],
 ['train_station', 23],
 ['entertainment_awards', 22],
 ['restaurant_1', 22],
 ['book_2', 21],
 ['perpetrator', 21],
 ['railway', 21],
 ['election_representative', 20],
 ['protein_institute', 20],
 ['wedding', 20],
 ['flight_company', 19],
 ['game_injury', 19],
 ['browser_web', 18],
 ['coffee_shop', 18],
 ['journal_committee', 18],
 ['news_report', 18],
 ['products_for_hire', 18],
 ['school_bus', 18],
 ['architecture', 17],
 ['local_govt_and_lot', 17],
 ['mountain_photos', 17],
 ['riding_club', 17],
 ['roller_coaster', 17],
 ['company_employee', 16],
 ['customer_deliveries', 16],
 ['department_management', 16],
 ['manufacturer', 16],
 ['station_weather', 16],
 ['customers_and_products_contacts', 15],
 ['customers_campaigns_ecommerce', 15],
 ['debate', 15],
 ['decoration_competition', 15],
 ['local_govt_in_alabama', 15],
 ['performance_attendance', 15],
 ['phone_market', 15],
 ['pilot_record', 15],
 ['solvency_ii', 15],
 ['local_govt_mdm', 14],
 ['soccer_1', 14],
 ['company_1', 7]]

In [26]:
db_id = "customers_and_addresses"
# "department_store"

In [8]:
q_df[q_df["db_id"]==db_id]

NameError: name 'db_id' is not defined

In [28]:
t_df[t_df["db_id"]==db_id].values
# ["column_names"].values

array([[list([[-1, '*'], [0, 'address id'], [0, 'address content'], [0, 'city'], [0, 'zip postcode'], [0, 'state province county'], [0, 'country'], [0, 'other address details'], [1, 'product id'], [1, 'product details'], [2, 'customer id'], [2, 'payment method'], [2, 'customer name'], [2, 'date became customer'], [2, 'other customer details'], [3, 'customer id'], [3, 'address id'], [3, 'date address from'], [3, 'address type'], [3, 'date address to'], [4, 'customer id'], [4, 'channel code'], [4, 'active from date'], [4, 'active to date'], [4, 'contact number'], [5, 'order id'], [5, 'customer id'], [5, 'order status'], [5, 'order date'], [5, 'order details'], [6, 'order id'], [6, 'product id'], [6, 'order quantity']]),
        list([[-1, '*'], [0, 'address_id'], [0, 'address_content'], [0, 'city'], [0, 'zip_postcode'], [0, 'state_province_county'], [0, 'country'], [0, 'other_address_details'], [1, 'product_id'], [1, 'product_details'], [2, 'customer_id'], [2, 'payment_method'], [2, 'customer_name'], [2, 'date_became_customer'], [2, 'other_customer_details'], [3, 'customer_id'], [3, 'address_id'], [3, 'date_address_from'], [3, 'address_type'], [3, 'date_address_to'], [4, 'customer_id'], [4, 'channel_code'], [4, 'active_from_date'], [4, 'active_to_date'], [4, 'contact_number'], [5, 'order_id'], [5, 'customer_id'], [5, 'order_status'], [5, 'order_date'], [5, 'order_details'], [6, 'order_id'], [6, 'product_id'], [6, 'order_quantity']]),
        list(['text', 'number', 'text', 'text', 'text', 'text', 'text', 'text', 'number', 'text', 'number', 'text', 'text', 'time', 'text', 'number', 'number', 'time', 'text', 'time', 'number', 'text', 'time', 'time', 'text', 'number', 'number', 'text', 'time', 'text', 'number', 'number', 'text']),
        'customers_and_addresses',
        list([[15, 10], [16, 1], [20, 10], [26, 10], [30, 25], [31, 8]]),
        list([1, 8, 10, 25]),
        list(['addresses', 'products', 'customers', 'customer addresses', 'customer contact channels', 'customer orders', 'order items']),
        list(['Addresses', 'Products', 'Customers', 'Customer_Addresses', 'Customer_Contact_Channels', 'Customer_Orders', 'Order_Items'])]],
      dtype=object)

In [29]:
with open( os.path.join(GV.SPIDER_FOLDER, "query_seq.json"), "r") as f:
    q_seq_data = json.load(f)

In [30]:
q_seq_data[db_id]["nl"]

[['Find the list of cities that no customer is living in.',
  'For which countries are there more than four distinct addresses listed?',
  'Find the state and country of all cities with post code starting with 4.',
  'List the countries having more than 4 addresses listed.',
  'Which city has the most customers living in?'],
 ['Find the name of all customers whose name contains "Alex".',
  'Find the customer name and date of the orders that have the status "Delivered".',
  'Find the name of customers who are living in Colorado?',
  'Find the name of the customer who made an order most recently.',
  'Return all the distinct payment methods used by customers.'],
 ['Return the the details of all products.',
  'Find the city where the most customers live.',
  'What are the state and country of all the cities that have post codes starting with 4.\\',
  'Find the name of all customers.',
  'What are the cities no customers live in?'],
 ['Which payment method is used by most customers?',
  'What are the names of customers using the most popular payment method?',
  'What are the names of customers who use payment method "Cash"?',
  'Find the payment method that is used most frequently.',
  'What is the payment method of the customer that has purchased the least quantity of items?'],
 ['What are the names of customers who live in Colorado state?',
  'What is the name of the customer that has purchased the most items?',
  'What are the names of customers who have purchased both products Latte and Americano?',
  'What are the customer name and date of the orders whose status is "Delivered".',
  'Return the total number of distinct customers.'],
 ['How many customers are living in city "Lake Geovannyton"?',
  'How many customers have at least one order with status "Cancelled"?',
  'What are the dates when customers with ids between 10 and 20 became customers?',
  'Find the number of customers who live in the city called Lake Geovannyton.',
  'Tell me the total quantity of products bought by the customer called "Rodrick Heaney".'],
 ['What is the most frequently ordered product? Tell me the detail of the product',
  'Find the detail of products whose detail contains the word "Latte" or the word "Americano"',
  'What are the names of all the customers?',
  'What are the name and ID of the product bought the most.',
  'What is the total quantity of products purchased by "Rodrick Heaney"?'],
 ['Find the name and ID of the product whose total order quantity is the largest.',
  'Find the name of the customer who made the order of the largest amount of goods.',
  'Tell me the number of orders with "Second time" as order detail.',
  'Give me the name of the customer who ordered the most items in total.',
  'Find the total amount of products ordered before 2018-03-17 07:13:53.'],
 ['Find the contact channel code that was used by the customer named "Tillman Ernser".',
  'List all the contact channel codes that were used less than 5 times.',
  'Which contact channel codes were used less than 5 times?',
  'What is the channel code and contact number of the customer contact channel that was active for the longest time?',
  'Find the name and active date of the customer that use email as the contact channel.'],
 ['What are the name and active date of the customers whose contact channel code is email?',
  'Return the channel code and contact number of the customer contact channel whose active duration was the longest.',
  'Find all the addresses in East Julianaside, Texas or in Gleasonmouth, Arizona.',
  'Which contact channel has been used by the customer with name "Tillman Ernser"?',
  'What are all the addresses in East Julianaside, Texas or in Gleasonmouth, Arizona.'],
 ['Which product has been ordered most number of times?',
  'What is the total number of products that are in orders with status "Cancelled"?',
  'What is the name of the customer that made the order with the largest quantity?',
  'How many orders have detail "Second time"?',
  'Find the total quantity of products associated with the orders in the "Cancelled" status.'],
 ['What is the "active to date" of the latest contact channel used by "Tillman Ernser"?',
  'Return the the "active to date" of the latest contact channel used by the customer named "Tillman Ernser".',
  'Find the average order quantity per order.',
  'Find the name of the customers who use the most frequently used payment method.',
  'What is the average amount of items ordered in each order?'],
 ['Which customers use "Cash" for payment method? Return the customer names.',
  'Find the names of customers who never placed an order.',
  'What are the names of customers who never made an order.',
  'Tell me the payment method used by the customer who ordered the least amount of goods in total.',
  'Find the names of customers who never ordered product Latte.'],
 ['Find the "date became customers" of the customers whose ID is between 10 and 20.',
  'How many customers are there?',
  'Return the number of customers who have at least one order with "Cancelled" status.'],
 ['What is the address content of the customer named "Maudie Kertzmann"?',
  'Return the address content for the customer whose name is "Maudie Kertzmann".',
  'Find the names of customers who ordered both products Latte and Americano.',
  'Find the name of customers who did not pay with Cash.',
  'What is the name of customers who do not use Cash as payment method.'],
 ['What are the details of all products?',
  'What are names of customers who never ordered product Latte.',
  'How many types of products have Rodrick Heaney bought in total?',
  'What is the total amount of products purchased before 2018-03-17 07:13:53?',
  'Which customer\'s name contains "Alex"? Find the full name.'],
 ['Who made the latest order?',
  'Which product\'s detail contains the word "Latte" or "Americano"? Return the full detail.',
  'List all the distinct cities']]

In [46]:
q_df.loc[q_df["db_id"]==db_id]["query"]

6055                  SELECT customer_name FROM customers
6056                  SELECT customer_name FROM customers
6057                       SELECT count(*) FROM customers
6058                       SELECT count(*) FROM customers
6059          SELECT avg(order_quantity) FROM order_items
                              ...
6138    SELECT customer_name FROM customers EXCEPT SEL...
6139    SELECT customer_name FROM customers EXCEPT SEL...
6140    SELECT customer_name FROM customers EXCEPT SEL...
6141    SELECT t1.customer_name FROM customers AS t1 J...
6142    SELECT t1.customer_name FROM customers AS t1 J...
Name: query, Length: 88, dtype: object

In [50]:
for sql in q_df.loc[q_df["db_id"]==db_id]["query"].values:
    print(sql)

SELECT customer_name FROM customers
SELECT customer_name FROM customers
SELECT count(*) FROM customers
SELECT count(*) FROM customers
SELECT avg(order_quantity) FROM order_items
SELECT avg(order_quantity) FROM order_items
SELECT customer_name FROM customers WHERE payment_method  =  "Cash"
SELECT customer_name FROM customers WHERE payment_method  =  "Cash"
SELECT date_became_customer FROM customers WHERE customer_id BETWEEN 10 AND 20
SELECT date_became_customer FROM customers WHERE customer_id BETWEEN 10 AND 20
SELECT payment_method FROM customers GROUP BY payment_method ORDER BY count(*) DESC LIMIT 1
SELECT payment_method FROM customers GROUP BY payment_method ORDER BY count(*) DESC LIMIT 1
SELECT customer_name FROM customers WHERE payment_method  =  (SELECT payment_method FROM customers GROUP BY payment_method ORDER BY count(*) DESC LIMIT 1)
SELECT customer_name FROM customers WHERE payment_method  =  (SELECT payment_method FROM customers GROUP BY payment_method ORDER BY count(*) DESC LIMIT 1)
SELECT DISTINCT payment_method FROM customers
SELECT DISTINCT payment_method FROM customers
SELECT DISTINCT product_details FROM products
SELECT DISTINCT product_details FROM products
SELECT customer_name FROM customers WHERE customer_name LIKE "%Alex%"
SELECT customer_name FROM customers WHERE customer_name LIKE "%Alex%"
SELECT product_details FROM products WHERE product_details LIKE "%Latte%" OR product_details LIKE "%Americano%"
SELECT product_details FROM products WHERE product_details LIKE "%Latte%" OR product_details LIKE "%Americano%"
SELECT t3.address_content FROM customers AS t1 JOIN customer_addresses AS t2 ON t1.customer_id  =  t2.customer_id JOIN addresses AS t3 ON t2.address_id  =  t3.address_id WHERE t1.customer_name  =  "Maudie Kertzmann"
SELECT t3.address_content FROM customers AS t1 JOIN customer_addresses AS t2 ON t1.customer_id  =  t2.customer_id JOIN addresses AS t3 ON t2.address_id  =  t3.address_id WHERE t1.customer_name  =  "Maudie Kertzmann"
SELECT count(*) FROM customers AS t1 JOIN customer_addresses AS t2 ON t1.customer_id  =  t2.customer_id JOIN addresses AS t3 ON t2.address_id  =  t3.address_id WHERE t3.city  =  "Lake Geovannyton"
SELECT count(*) FROM customers AS t1 JOIN customer_addresses AS t2 ON t1.customer_id  =  t2.customer_id JOIN addresses AS t3 ON t2.address_id  =  t3.address_id WHERE t3.city  =  "Lake Geovannyton"
SELECT t1.customer_name FROM customers AS t1 JOIN customer_addresses AS t2 ON t1.customer_id  =  t2.customer_id JOIN addresses AS t3 ON t2.address_id  =  t3.address_id WHERE t3.state_province_county  =  "Colorado"
SELECT t1.customer_name FROM customers AS t1 JOIN customer_addresses AS t2 ON t1.customer_id  =  t2.customer_id JOIN addresses AS t3 ON t2.address_id  =  t3.address_id WHERE t3.state_province_county  =  "Colorado"
SELECT city FROM addresses WHERE city NOT IN ( SELECT DISTINCT t3.city FROM customers AS t1 JOIN customer_addresses AS t2 ON t1.customer_id  =  t2.customer_id JOIN addresses AS t3 ON t2.address_id  =  t3.address_id)
SELECT city FROM addresses WHERE city NOT IN ( SELECT DISTINCT t3.city FROM customers AS t1 JOIN customer_addresses AS t2 ON t1.customer_id  =  t2.customer_id JOIN addresses AS t3 ON t2.address_id  =  t3.address_id)
SELECT t3.city FROM customers AS t1 JOIN customer_addresses AS t2 ON t1.customer_id  =  t2.customer_id JOIN addresses AS t3 ON t2.address_id  =  t3.address_id GROUP BY t3.city ORDER BY count(*) DESC LIMIT 1
SELECT t3.city FROM customers AS t1 JOIN customer_addresses AS t2 ON t1.customer_id  =  t2.customer_id JOIN addresses AS t3 ON t2.address_id  =  t3.address_id GROUP BY t3.city ORDER BY count(*) DESC LIMIT 1
SELECT DISTINCT city FROM addresses
SELECT DISTINCT city FROM addresses
SELECT city FROM addresses WHERE zip_postcode  =  255
SELECT city FROM addresses WHERE zip_postcode  =  255
SELECT state_province_county ,  country FROM addresses WHERE zip_postcode LIKE "4%"
SELECT state_province_county ,  country FROM addresses WHERE zip_postcode LIKE "4%"
SELECT country FROM addresses GROUP BY country HAVING count(address_id)  >  4
SELECT country FROM addresses GROUP BY country HAVING count(address_id)  >  4
SELECT channel_code FROM customer_contact_channels GROUP BY channel_code HAVING count(customer_id)  <  5
SELECT channel_code FROM customer_contact_channels GROUP BY channel_code HAVING count(customer_id)  <  5
SELECT DISTINCT channel_code FROM customers AS t1 JOIN customer_contact_channels AS t2 ON t1.customer_id  =  t2.customer_id WHERE t1.customer_name  =  "Tillman Ernser"
SELECT DISTINCT channel_code FROM customers AS t1 JOIN customer_contact_channels AS t2 ON t1.customer_id  =  t2.customer_id WHERE t1.customer_name  =  "Tillman Ernser"
SELECT max(t2.active_to_date) FROM customers AS t1 JOIN customer_contact_channels AS t2 ON t1.customer_id  =  t2.customer_id WHERE t1.customer_name  =  "Tillman Ernser"
SELECT max(t2.active_to_date) FROM customers AS t1 JOIN customer_contact_channels AS t2 ON t1.customer_id  =  t2.customer_id WHERE t1.customer_name  =  "Tillman Ernser"
SELECT avg(active_to_date - active_from_date) FROM customer_contact_channels
SELECT avg(active_to_date - active_from_date) FROM customer_contact_channels
SELECT channel_code ,  contact_number FROM customer_contact_channels WHERE active_to_date - active_from_date  =  (SELECT active_to_date - active_from_date FROM customer_contact_channels ORDER BY (active_to_date - active_from_date) DESC LIMIT 1)
SELECT channel_code ,  contact_number FROM customer_contact_channels WHERE active_to_date - active_from_date  =  (SELECT active_to_date - active_from_date FROM customer_contact_channels ORDER BY (active_to_date - active_from_date) DESC LIMIT 1)
SELECT t1.customer_name ,  t2.active_from_date FROM customers AS t1 JOIN customer_contact_channels AS t2 ON t1.customer_id  =  t2.customer_id WHERE t2.channel_code  =  'Email'
SELECT t1.customer_name ,  t2.active_from_date FROM customers AS t1 JOIN customer_contact_channels AS t2 ON t1.customer_id  =  t2.customer_id WHERE t2.channel_code  =  'Email'
SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id WHERE t3.order_quantity  =  ( SELECT max(order_quantity) FROM order_items)
SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id WHERE t3.order_quantity  =  ( SELECT max(order_quantity) FROM order_items)
SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id GROUP BY t1.customer_name ORDER BY sum(t3.order_quantity) DESC LIMIT 1
SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id GROUP BY t1.customer_name ORDER BY sum(t3.order_quantity) DESC LIMIT 1
SELECT t1.payment_method FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id GROUP BY t1.customer_name ORDER BY sum(t3.order_quantity) LIMIT 1
SELECT t1.payment_method FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id GROUP BY t1.customer_name ORDER BY sum(t3.order_quantity) LIMIT 1
SELECT count(DISTINCT t3.product_id) FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id WHERE t1.customer_name  =  "Rodrick Heaney"
SELECT count(DISTINCT t3.product_id) FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id WHERE t1.customer_name  =  "Rodrick Heaney"
SELECT sum(t3.order_quantity) FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id WHERE t1.customer_name  =  "Rodrick Heaney"
SELECT sum(t3.order_quantity) FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id WHERE t1.customer_name  =  "Rodrick Heaney"
SELECT count(DISTINCT customer_id) FROM customer_orders WHERE order_status  =  "Cancelled"
SELECT count(DISTINCT customer_id) FROM customer_orders WHERE order_status  =  "Cancelled"
SELECT count(*) FROM customer_orders WHERE order_details  =  "Second time"
SELECT count(*) FROM customer_orders WHERE order_details  =  "Second time"
SELECT t1.customer_name ,  t2.order_date FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id WHERE order_status  =  "Delivered"
SELECT t1.customer_name ,  t2.order_date FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id WHERE order_status  =  "Delivered"
SELECT sum(t2.order_quantity) FROM customer_orders AS t1 JOIN order_items AS t2 ON t1.order_id  =  t2.order_id WHERE t1.order_status  =  "Cancelled"
SELECT sum(t2.order_quantity) FROM customer_orders AS t1 JOIN order_items AS t2 ON t1.order_id  =  t2.order_id WHERE t1.order_status  =  "Cancelled"
SELECT sum(t2.order_quantity) FROM customer_orders AS t1 JOIN order_items AS t2 ON t1.order_id  =  t2.order_id WHERE t1.order_date  <  "2018-03-17 07:13:53"
SELECT sum(t2.order_quantity) FROM customer_orders AS t1 JOIN order_items AS t2 ON t1.order_id  =  t2.order_id WHERE t1.order_date  <  "2018-03-17 07:13:53"
SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id ORDER BY t2.order_date DESC LIMIT 1
SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id ORDER BY t2.order_date DESC LIMIT 1
SELECT t2.product_details FROM order_items AS t1 JOIN products AS t2 ON t1.product_id  =  t2.product_id GROUP BY t1.product_id ORDER BY count(*) DESC LIMIT 1
SELECT t2.product_details FROM order_items AS t1 JOIN products AS t2 ON t1.product_id  =  t2.product_id GROUP BY t1.product_id ORDER BY count(*) DESC LIMIT 1
SELECT t2.product_details ,  t2.product_id FROM order_items AS t1 JOIN products AS t2 ON t1.product_id  =  t2.product_id GROUP BY t1.product_id ORDER BY sum(t1.order_quantity) LIMIT 1
SELECT t2.product_details ,  t2.product_id FROM order_items AS t1 JOIN products AS t2 ON t1.product_id  =  t2.product_id GROUP BY t1.product_id ORDER BY sum(t1.order_quantity) LIMIT 1
SELECT address_content FROM addresses WHERE city  =  "East Julianaside" AND state_province_county  =  "Texas" UNION SELECT address_content FROM addresses WHERE city  =  "Gleasonmouth" AND state_province_county  =  "Arizona"
SELECT address_content FROM addresses WHERE city  =  "East Julianaside" AND state_province_county  =  "Texas" UNION SELECT address_content FROM addresses WHERE city  =  "Gleasonmouth" AND state_province_county  =  "Arizona"
SELECT customer_name FROM customers WHERE payment_method != 'Cash'
SELECT customer_name FROM customers WHERE payment_method != 'Cash'
SELECT customer_name FROM customers EXCEPT SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id JOIN products AS t4 ON t3.product_id  =  t4.product_id WHERE t4.product_details  =  'Latte'
SELECT customer_name FROM customers EXCEPT SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id JOIN products AS t4 ON t3.product_id  =  t4.product_id WHERE t4.product_details  =  'Latte'
SELECT customer_name FROM customers EXCEPT SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id
SELECT customer_name FROM customers EXCEPT SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id
SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id JOIN products AS t4 ON t3.product_id  =  t4.product_id WHERE t4.product_details  =  'Latte' INTERSECT SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id JOIN products AS t4 ON t3.product_id  =  t4.product_id WHERE t4.product_details  =  'Americano'
SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id JOIN products AS t4 ON t3.product_id  =  t4.product_id WHERE t4.product_details  =  'Latte' INTERSECT SELECT t1.customer_name FROM customers AS t1 JOIN customer_orders AS t2 ON t1.customer_id  =  t2.customer_id JOIN order_items AS t3 ON t2.order_id  =  t3.order_id JOIN products AS t4 ON t3.product_id  =  t4.product_id WHERE t4.product_details  =  'Americano'